In [37]:
import csv

In [38]:
import pandas as pd

In [39]:
import json

In [40]:
data = json.load(open('Friends.json'))

In [41]:
print(data)

[{'Age': 19, 'Lastname': 'Sausen', 'Name': 'Maddie', 'School': 'Hunter'}, {'Age': 19, 'Lastname': 'Maryles', 'Name': 'Chuckie', 'School': 'Cornell'}, {'Age': 19, 'Lastname': 'Slasky', 'Name': 'Bean', 'School': 'Stern'}, {'Age': 19, 'Lastname': 'Fried', 'Name': 'Gilly', 'School': 'Maryland'}, {'Age': 19, 'Lastname': 'Goldstein', 'Name': 'Maya', 'School': 'Hunter'}]

In [43]:

data_file = open("Friends.csv", "w")
csv_writer = csv.writer(data_file)
csv_writer.writerow(data[0].keys())
for item in data:
    csv_writer.writerow(item.values())
data_file.close()

In [44]:
df = pd.read_csv("Friends.csv")
df

   Age   Lastname     Name    School
0   19     Sausen   Maddie    Hunter
1   19    Maryles  Chuckie   Cornell
2   19     Slasky     Bean     Stern
3   19      Fried    Gilly  Maryland
4   19  Goldstein     Maya    Hunter

In [45]:
age = df["Age"]
print (age)

0    19
1    19
2    19
3    19
4    19
Name: Age, dtype: int64